Revit 2027 API
DatumPlane.HideBubbleInView Method
 Hides the bubble in a view. This method does not apply to Reference planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideBubbleInView(
	DatumEnds datumEnd,
	View view
)
Public Sub HideBubbleInView (
	datumEnd As DatumEnds,
	view As View
)
public:
void HideBubbleInView(
	DatumEnds datumEnd,
	View^ view
)
member HideBubbleInView :
        datumEnd : DatumEnds *
        view : View -> unit
Parameters
datumEnd DatumEnds
 The end of the datum plane.
view View
 The view on which the DatumPlane shows.
Exceptions
Exception | Condition
ArgumentException |  The datum plane cannot be visible in the view.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This datum plane doesn't support bubble operations.
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace